In [1]:
import pandas as pd
import numpy as np

In [2]:
db=pd.read_csv("Data.csv")
db

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [3]:
db.isna().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [4]:
#preprocessing
#1.Missing Values

In [5]:
db[ 'Age' ]=db[ 'Age' ].fillna( db[ 'Age' ].mean() )
db[ 'Salary' ]=db[ 'Salary' ].fillna( db[ 'Salary' ].mean() )

In [6]:
db.isna().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

In [7]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
db['Purchased'] = le.fit_transform(db['Purchased'])

In [9]:
data = pd.get_dummies(db,drop_first=True)
data

         Age        Salary  Purchased  Country_Germany  Country_Spain
0  44.000000  72000.000000          0                0              0
1  27.000000  48000.000000          1                0              1
2  30.000000  54000.000000          0                1              0
3  38.000000  61000.000000          0                0              1
4  40.000000  63777.777778          1                1              0
5  35.000000  58000.000000          1                0              0
6  38.777778  52000.000000          0                0              1
7  48.000000  79000.000000          1                0              0
8  50.000000  83000.000000          0                1              0
9  37.000000  67000.000000          1                0              0